In [1]:
# INIT
import pandas as pd
import numpy as np
import psycopg2
from sqlalchemy import create_engine

In [2]:
# HELPER FUNCTION
def to_dict(arr):
    return dict(zip(arr, [x + 1 for x in range(len(arr))]))

In [3]:
orders = pd.DataFrame()

# Database Connection

In [4]:
engine = create_engine('postgresql+psycopg2://stadvdb_user:password@127.0.0.1/stadvdb_db2', pool_recycle=3600)
conn   = engine.connect()

In [5]:
# Database Helper
def colission_nothing(table, conn, keys, data_iter):
    keys = ', '.join(keys)
    for row in data_iter:
        sql = "SELECT setval('{}_id_seq', MAX(id)) FROM {};".format(table.name, table.name)
        conn.execute(sql)

        if len(row) > 1:
            sql = 'INSERT INTO {}({}) VALUES {} ON CONFLICT DO NOTHING;'.format(table.name, keys, row)
        else:
            sql = "INSERT INTO {}({}) VALUES ('{}') ON CONFLICT DO NOTHING;".format(table.name, keys, row[0])
        conn.execute(sql)

In [6]:
def export_retrieve(df, table_name):
    df.to_sql(table_name, conn, index=False, if_exists='append', method=colission_nothing)
    return pd.read_sql('SELECT * FROM {} ORDER BY id;'.format(table_name), conn)

# Import the data

In [7]:
df = pd.read_csv('sales_data_sample.csv')

In [8]:
# Change NaN to WEST
df['TERRITORY'] = df['TERRITORY'].fillna('WEST')

In [9]:
df = df.rename(
    columns={
        'YEAR_ID': 'year',
        'QTR_ID': 'quarter',
        'MONTH_ID': 'month',
        'TERRITORY': 'territory',
        'COUNTRY': 'country',
        'CITY': 'city',
        'STATUS': 'status',
        'PRODUCTLINE': 'product_line',
        'PRODUCTCODE': 'product_code',
    })

In [10]:
df.head()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,status,quarter,month,year,...,ADDRESSLINE1,ADDRESSLINE2,city,STATE,POSTALCODE,country,territory,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,WEST,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,WEST,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,WEST,Brown,Julie,Medium

In [11]:
len(df)

2823

# Period Dimension

In [12]:
# Get all the data at YEAR_ID, QTR_ID, MONTH_ID
# and convert them to year, quarter, month
periods = df[['year', 'quarter', 'month']]
periods = periods.groupby(['year', 'quarter', 'month'], as_index=False).last()
periods = export_retrieve(periods, 'periods')
periods

    id  year  quarter  month
0    1  2003        1      1
1    2  2003        1      2
2    3  2003        1      3
3    4  2003        2      4
4    5  2003        2      5
5    6  2003        2      6
6    7  2003        3      7
7    8  2003        3      8
8    9  2003        3      9
9   10  2003        4     10
10  11  2003        4     11
11  12  2003        4     12
12  13  2004        1      1
13  14  2004        1      2
14  15  2004        1      3
15  16  2004        2      4
16  17  2004        2      5
17  18  2004        2      6
18  19  2004        3      7
19  20  2004        3      8
20  21  2004        3      9
21  22  2004        4     10
22  23  2004        4     11
23  24  2004        4     12
24  25  2005        1      1
25  26  2005        1      2
26  27  2005        1      3
27  28  2005        2      4
28  29  2005        2      5

In [13]:
# Map it to orders
periods['key'] = periods['year'].map(str) + '-' + periods['quarter'].map(str) + '-' + periods['month'].map(str)
period_dict = to_dict(periods['key'])

orders['period_id'] = df['year'].map(str) + '-' + df['quarter'].map(str) + '-' + df['month'].map(str)
orders['period_id'] = orders['period_id'].map(period_dict)
orders.head()

   period_id
0          2
1          5
2          7
3          8
4         10

# Territory Dimension

In [14]:
territory = { 'name': df['territory'].unique() }

territories = pd.DataFrame(territory)
territories = export_retrieve(territories, 'territories')
territories

   id   name
0   1   WEST
1   2   EMEA
2   3   APAC
3   4  Japan

In [15]:
country = { 'name': df['country'].unique() }

countries = pd.DataFrame(country)
countries = export_retrieve(countries, 'countries')
countries

    id         name
0    1          USA
1    2       France
2    3       Norway
3    4    Australia
4    5      Finland
5    6      Austria
6    7           UK
7    8        Spain
8    9       Sweden
9   10    Singapore
10  11       Canada
11  12        Japan
12  13        Italy
13  14      Denmark
14  15      Belgium
15  16  Philippines
16  17      Germany
17  18  Switzerland
18  19      Ireland

In [16]:
city = { 'name': df['city'].unique() }

cities = pd.DataFrame(city)
cities = export_retrieve(cities, 'cities')
cities

    id           name
0    1            NYC
1    2          Reims
2    3          Paris
3    4       Pasadena
4    5  San Francisco
..  ..            ...
68  69           Oslo
69  70        Bergamo
70  71   Glen Waverly
71  72         Munich
72  73      Charleroi

[73 rows x 2 columns]

In [17]:
# Get their mapping values
territories_dict = to_dict(territory['name'])
countries_dict = to_dict(country['name'])
cities_dict = to_dict(city['name'])

In [18]:
territory_s = df['territory'].map(territories_dict)
country_s = df['country'].map(countries_dict)
city_s = df['city'].map(cities_dict)

In [19]:
location_dict = {
    'territory_id': territory_s,
    'country_id': country_s,
    'city_id': city_s
}

locations_n = pd.DataFrame(location_dict)

In [20]:
locations = locations_n.groupby(['territory_id', 'country_id', 'city_id'], as_index=False).last()
locations = export_retrieve(locations, 'locations')

In [21]:
# Map it to orders
locations['key'] = locations['territory_id'].map(str) + '-' + locations['country_id'].map(str) + '-' + locations['city_id'].map(str)
locations_dict = to_dict(locations['key'])

orders['location_id'] = locations_n['territory_id'].map(str) + '-' + locations_n['country_id'].map(str) + '-' + locations_n['city_id'].map(str)
orders['location_id'] = orders['location_id'].map(locations_dict)
orders.head()

   period_id  location_id
0          2            1
1          5           27
2          7           28
3          8            2
4         10            3

# Order Detail Dimension

In [22]:
status = { 'name': df['status'].unique() }

statuses = pd.DataFrame(status)
statuses = export_retrieve(statuses, 'statuses')
statuses

   id        name
0   1     Shipped
1   2    Disputed
2   3  In Process
3   4   Cancelled
4   5     On Hold
5   6    Resolved

In [23]:
product_line = { 'name': df['product_line'].unique() }

product_lines = pd.DataFrame(product_line)
product_lines = export_retrieve(product_lines, 'product_lines')
product_lines

   id              name
0   1       Motorcycles
1   2      Classic Cars
2   3  Trucks and Buses
3   4      Vintage Cars
4   5            Planes
5   6             Ships
6   7            Trains

In [24]:
product_code = { 'name': df['product_code'].unique() }

product_codes = pd.DataFrame(product_code)
product_codes = export_retrieve(product_codes, 'product_codes')
product_codes

      id       name
0      1   S10_1678
1      2   S10_1949
2      3   S10_2016
3      4   S10_4698
4      5   S10_4757
..   ...        ...
104  105  S700_3505
105  106  S700_3962
106  107  S700_4002
107  108   S72_1253
108  109   S72_3212

[109 rows x 2 columns]

In [25]:
status_dict = to_dict(status['name'])
product_line_dict = to_dict(product_lines['name'])
product_code_dict = to_dict(product_codes['name'])

In [26]:
status_s = df['status'].map(status_dict)
product_line_s = df['product_line'].map(product_line_dict)
product_code_s = df['product_code'].map(product_code_dict)

In [27]:
order_details_dict = {
    'status_id': status_s,
    'product_line_id': product_line_s,
    'product_code_id': product_code_s
}

order_details_n = pd.DataFrame(order_details_dict)
order_details = order_details_n.groupby(['status_id', 'product_line_id', 'product_code_id'], as_index=False).last()
order_details = export_retrieve(order_details, 'order_details')
order_details

      id  status_id  product_line_id  product_code_id
0      1          1                1                1
1      2          1                1                3
2      3          1                1                4
3      4          1                1               10
4      5          1                1               32
..   ...        ...              ...              ...
285  286          6                6               99
286  287          6                6              101
287  288          6                6              105
288  289          6                6              106
289  290          6                6              109

[290 rows x 4 columns]

In [28]:
order_details['key'] = order_details['status_id'].map(str) + '-' + order_details['product_line_id'].map(str) + '-' + order_details['product_code_id'].map(str)
order_details_dict = to_dict(order_details['key'])

orders['order_detail_id'] = order_details_n['status_id'].map(str) + '-' + order_details_n['product_line_id'].map(str) + '-' + order_details_n['product_code_id'].map(str)
orders['order_detail_id'] = orders['order_detail_id'].map(order_details_dict)
orders.head()

   period_id  location_id  order_detail_id
0          2            1                1
1          5           27                1
2          7           28                1
3          8            2                1
4         10            3                1

# Order Dimension Merged

In [29]:
orders['sales'] = df['SALES']
orders = export_retrieve(orders, 'orders')
orders

        id  period_id  location_id  order_detail_id    sales
0        1          2            1                1  2871.00
1        2          5           27                1  2765.90
2        3          7           28                1  3884.34
3        4          8            2                1  3746.70
4        5         10            3                1  5205.27
...    ...        ...          ...              ...      ...
5641  5642         24           48              106  2244.40
5642  5643         25           40              106  3978.51
5643  5644         27           48              290  5417.57
5644  5645         27           33              106  2116.16
5645  5646         29           19              249  3079.44

[5646 rows x 5 columns]

In [30]:
conn.close()